In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['r1', 'r2', 'r3', 'r4', 'r5'], columns=['c1', 'c2', 'c3', 'c4'])

In [3]:
df.head()

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [9]:
df.loc['r5']

c1    16
c2    17
c3    18
c4    19
Name: r5, dtype: int32

In [13]:
df.iloc[0]

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int32

In [14]:
type(df.loc['r1'])

pandas.core.series.Series

In [16]:
df

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [17]:
df.iloc[::].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [18]:
df.iloc[::].values.shape

(5, 4)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, r1 to r5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int32
 1   c2      5 non-null      int32
 2   c3      5 non-null      int32
 3   c4      5 non-null      int32
dtypes: int32(4)
memory usage: 292.0+ bytes

In [20]:
df.describe() # Generate descriptive statistics.

              c1         c2         c3         c4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [21]:
df.tail()

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [23]:
df.loc[['r1', 'r3']]

    c1  c2  c3  c4
r1   0   1   2   3
r3   8   9  10  11

In [26]:
df.iloc[[0, 2]]

    c1  c2  c3  c4
r1   0   1   2   3
r3   8   9  10  11